# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.

N = int(input('Ваедите число N: '))
i = 1
while i <= N:

    print(i)
    i = i * 2