# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядк

N = int(input('Введите количество кустов: '))
list = list(map(int, input(f'Введите {N} цифр через пробел: ').split()))
if len(list) > N or len(list) < N:
    print('ОШИБКА!')
else:
    print('Получаем: ')
    N = len(list)
    list = list + list[:2]
    m = 0
    for i in range(N):
        m = max(m, list[i] + list[i + 1] + list[i + 2])
print(m)